/*! Copyright (c) 2006-2011 by OpenLayers Contributors (see authors.txt for
* full list of contributors). Published under the Clear BSD license.
* See http://svn.openlayers.org/trunk/openlayers/license.txt for the
* full text of the license. */

/* Translators (2009 onwards):
 *  - Fryed-peach
 *  - Mage Whopper
 */

/**
 * @requires OpenLayers/Lang.js
 */

/**
 * Namespace: OpenLayers.Lang["ja"]
 * Dictionary for æ—¥æœ¬èªž.  Keys for entries are used in calls to
 *     <OpenLayers.Lang.translate>.  Entry bodies are normal strings or
 *     strings formatted for use with <OpenLayers.String.format> calls.
 */

OpenLayers.Lang["ja"] = OpenLayers.Util.applyDefaults({

    'unhandledRequest': "æœªå‡¦ç?†ã?®è¦?æ±‚ã?¯ ${statusText} ã‚’è¿”ã?—ã?¾ã?™",

    'Permalink': "ãƒ‘ãƒ¼ãƒžãƒªãƒ³ã‚¯",

    'Overlays': "ã‚ªãƒ¼ãƒ?ãƒ¼ãƒ¬ã‚¤",

    'Base Layer': "åŸºåº•ãƒ¬ã‚¤ãƒ¤ãƒ¼",

    'readNotImplemented': "èª­ã?¿è¾¼ã?¿ã?¯å®Ÿè£…ã?•ã‚Œã?¦ã?„ã?¾ã?›ã‚“ã€‚",

    'writeNotImplemented': "æ›¸ã??è¾¼ã?¿ã?¯å®Ÿè£…ã?•ã‚Œã?¦ã?„ã?¾ã?›ã‚“ã€‚",

    'noFID': "FID ã?®ã?ªã?„åœ°ç‰©ã?¯æ›´æ–°ã?§ã??ã?¾ã?›ã‚“ã€‚",

    'errorLoadingGML': "GML ãƒ•ã‚¡ã‚¤ãƒ« ${url} ã?®èª­ã?¿è¾¼ã?¿ã‚¨ãƒ©ãƒ¼",

    'browserNotSupported': "ã?‚ã?ªã?Ÿã?®ãƒ–ãƒ©ã‚¦ã‚¶ã?¯ãƒ™ã‚¯ã‚¿ãƒ¼ã‚°ãƒ©ãƒ•ã‚£ãƒƒã‚¯ã‚¹ã?®æ??å†™ã?«å¯¾å¿œã?—ã?¦ã?„ã?¾ã?›ã‚“ã€‚ç?¾æ™‚ç‚¹ã?§å¯¾å¿œã?—ã?¦ã?„ã‚‹ã‚½ãƒ•ãƒˆã‚¦ã‚§ã‚¢ã?¯ä»¥ä¸‹ã?®ã‚‚ã?®ã?§ã?™ã€‚\n${renderers}",

    'componentShouldBe': "addFeatures: è¦?ç´ ã?¯ ${geomType} ã?§ã?‚ã‚‹ã?¹ã??ã?§ã?™",

    'getFeatureError': "getFeatureFromEvent ã?Œãƒ¬ãƒ³ãƒ€ãƒ©ãƒ¼ã?®ã?ªã?„ãƒ¬ã‚¤ãƒ¤ãƒ¼ã?‹ã‚‰å‘¼ã?°ã‚Œã?¾ã?—ã?Ÿã€‚é€šå¸¸ã€?ã?“ã‚Œã?¯ã?‚ã?ªã?Ÿã?Œãƒ¬ã‚¤ãƒ¤ãƒ¼ã‚’ã€?ã??ã‚Œã?«é–¢é€£ã?¥ã?‘ã‚‰ã‚Œã?Ÿã?„ã??ã?¤ã?‹ã?®ãƒ?ãƒ³ãƒ‰ãƒ©ã‚’é™¤ã?„ã?¦ã€?ç ´å£Šã?—ã?¦ã?—ã?¾ã?£ã?Ÿã?“ã?¨ã‚’æ„?å‘³ã?—ã?¾ã?™ã€‚",

    'minZoomLevelError': "minZoomLevel ãƒ—ãƒ­ãƒ‘ãƒ†ã‚£ã?¯ FixedZoomLevels ã‚’ç¶™æ‰¿ã?™ã‚‹ãƒ¬ã‚¤ãƒ¤ãƒ¼ã?§ã?®ä½¿ç”¨ã?®ã?¿ã‚’æƒ³å®šã?—ã?¦ã?„ã?¾ã?™ã€‚ã?“ã?® minZoomLevel ã?«å¯¾ã?™ã‚‹ WFS ãƒ¬ã‚¤ãƒ¤ãƒ¼ã?®æ¤œæŸ»ã?¯æ­´å?²çš„ã?ªã‚‚ã?®ã?§ã?™ã€‚ã?—ã?‹ã?—ã?ªã?Œã‚‰ã€?ã?“ã?®æ¤œæŸ»ã‚’é™¤åŽ»ã?™ã‚‹ã?¨ã??ã‚Œã?«ä¾?å­˜ã?™ã‚‹ OpenLayers ãƒ™ãƒ¼ã‚¹ã?®ã‚¢ãƒ—ãƒªã‚±ãƒ¼ã‚·ãƒ§ãƒ³ã‚’ç ´å£Šã?—ã?¦ã?—ã?¾ã?†å?¯èƒ½æ€§ã?Œã?‚ã‚Šã?¾ã?™ã€‚ã‚ˆã?£ã?¦å»ƒæ­¢ã?Œäºˆå®šã?•ã‚Œã?¦ã?Šã‚Šã€?ã?“ã?® minZoomLevel æ¤œæŸ»ã?¯ãƒ?ãƒ¼ã‚¸ãƒ§ãƒ³3.0ã?§é™¤åŽ»ã?•ã‚Œã?¾ã?™ã€‚ä»£ã‚?ã‚Šã?«ã€?http://trac.openlayers.org/wiki/SettingZoomLevels ã?§è§£èª¬ã?•ã‚Œã?¦ã?„ã‚‹ã€?æœ€å°?ã?Šã‚ˆã?³æœ€å¤§è§£åƒ?åº¦è¨­å®šã‚’ä½¿ç”¨ã?—ã?¦ã??ã? ã?•ã?„ã€‚",

    'commitSuccess': "WFS ãƒˆãƒ©ãƒ³ã‚¶ã‚¯ã‚·ãƒ§ãƒ³: æˆ?åŠŸ ${response}",

    'commitFailed': "WFS ãƒˆãƒ©ãƒ³ã‚¶ã‚¯ã‚·ãƒ§ãƒ³: å¤±æ•— ${response}",

    'googleWarning': "Google ãƒ¬ã‚¤ãƒ¤ãƒ¼ã?Œæ­£ã?—ã??èª­ã?¿è¾¼ã?¿ã‚’è¡Œã?ˆã?¾ã?›ã‚“ã?§ã?—ã?Ÿã€‚\x3cbr\x3e\x3cbr\x3eã?“ã?®ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚’æ¶ˆã?™ã?«ã?¯ã€?å?³ä¸Šã?®éš…ã?«ã?‚ã‚‹ãƒ¬ã‚¤ãƒ¤ãƒ¼åˆ‡ã‚Šæ›¿ã?ˆéƒ¨åˆ†ã?§æ–°ã?—ã?„åŸºåº•ãƒ¬ã‚¤ãƒ¤ãƒ¼ã‚’é?¸ã‚“ã?§ã??ã? ã?•ã?„ã€‚\x3cbr\x3e\x3cbr\x3eã?Šã??ã‚‰ã??ã€?ã?“ã‚Œã?¯ Google ãƒžãƒƒãƒ—ç”¨ãƒ©ã‚¤ãƒ–ãƒ©ãƒªã?®ã‚¹ã‚¯ãƒªãƒ—ãƒˆã?Œçµ„ã?¿è¾¼ã?¾ã‚Œã?¦ã?„ã?ªã?„ã?‹ã€?ã?‚ã?ªã?Ÿã?®ã‚µã‚¤ãƒˆã?«å¯¾å¿œã?™ã‚‹æ­£ã?—ã?„ API ã‚­ãƒ¼ã?Œè¨­å®šã?•ã‚Œã?¦ã?„ã?ªã?„ã?Ÿã‚?ã?§ã?™ã€‚\x3cbr\x3e\x3cbr\x3eé–‹ç™ºè€…ã?®æ–¹ã?¸: æ­£ã?—ã?„å‹•ä½œã‚’ã?•ã?›ã‚‹ã?Ÿã‚?ã?«\x3ca href=\'http://trac.openlayers.org/wiki/Google\' target=\'_blank\'\x3eã?“ã?¡ã‚‰ã?®ã‚¦ã‚£ã‚­\x3c/a\x3eã‚’å?‚ç…§ã?—ã?¦ã??ã? ã?•ã?„ã€‚",

    'getLayerWarning': "${layerType} ãƒ¬ã‚¤ãƒ¤ãƒ¼ã?Œæ­£ã?—ã??èª­ã?¿è¾¼ã?¿ã‚’è¡Œã?ˆã?¾ã?›ã‚“ã?§ã?—ã?Ÿã€‚\x3cbr\x3e\x3cbr\x3eã?“ã?®ãƒ¡ãƒƒã‚»ãƒ¼ã‚¸ã‚’æ¶ˆã?™ã?«ã?¯ã€?å?³ä¸Šã?®éš…ã?«ã?‚ã‚‹ãƒ¬ã‚¤ãƒ¤ãƒ¼åˆ‡ã‚Šæ›¿ã?ˆéƒ¨åˆ†ã?§æ–°ã?—ã?„åŸºåº•ãƒ¬ã‚¤ãƒ¤ãƒ¼ã‚’é?¸ã‚“ã?§ã??ã? ã?•ã?„ã€‚\x3cbr\x3e\x3cbr\x3eã?Šã??ã‚‰ã??ã€?ã?“ã‚Œã?¯ ${layerLib} ãƒ©ã‚¤ãƒ–ãƒ©ãƒªã?®ã‚¹ã‚¯ãƒªãƒ—ãƒˆã?Œæ­£ã?—ã??çµ„ã?¿è¾¼ã?¾ã‚Œã?¦ã?„ã?ªã?„ã?Ÿã‚?ã?§ã?™ã€‚\x3cbr\x3e\x3cbr\x3eé–‹ç™ºè€…ã?®æ–¹ã?¸: æ­£ã?—ã?„å‹•ä½œã‚’ã?•ã?›ã‚‹ã?Ÿã‚?ã?«\x3ca href=\'http://trac.openlayers.org/wiki/${layerLib}\' target=\'_blank\'\x3eã?“ã?¡ã‚‰ã?®ã‚¦ã‚£ã‚­\x3c/a\x3eã‚’å?‚ç…§ã?—ã?¦ã??ã? ã?•ã?„ã€‚",

    'Scale = 1 : ${scaleDenom}': "ç¸®å°º = 1 : ${scaleDenom}",

    'W': "è¥¿",

    'E': "æ?±",

    'N': "åŒ—",

    'S': "å?—",

    'layerAlreadyAdded': "ã?‚ã?ªã?Ÿã?¯ã€Œ${layerName}ã€?ã‚’åœ°å›³ã?«è¿½åŠ ã?—ã‚ˆã?†ã?¨è©¦ã?¿ã?¾ã?—ã?Ÿã?Œã€?ã??ã?®ãƒ¬ã‚¤ãƒ¤ãƒ¼ã?¯æ—¢ã?«è¿½åŠ ã?•ã‚Œã?¦ã?„ã?¾ã?™",

    'reprojectDeprecated': "ã?‚ã?ªã?Ÿã?¯ã€Œ${layerName}ã€?ãƒ¬ã‚¤ãƒ¤ãƒ¼ã?§ reproject ã‚ªãƒ—ã‚·ãƒ§ãƒ³ã‚’ä½¿ã?£ã?¦ã?„ã?¾ã?™ã€‚ã?“ã?®ã‚ªãƒ—ã‚·ãƒ§ãƒ³ã?¯å•†ç”¨ã?®åŸºåº•åœ°å›³ä¸Šã?«æƒ…å ±ã‚’è¡¨ç¤ºã?™ã‚‹ç›®çš„ã?§è¨­è¨ˆã?•ã‚Œã?¾ã?—ã?Ÿã?Œã€?ç?¾åœ¨ã?§ã?¯ã??ã?®æ©Ÿèƒ½ã?¯ Spherical Mercator ã‚µãƒ?ãƒ¼ãƒˆã‚’åˆ©ç”¨ã?—ã?¦å®Ÿç?¾ã?•ã‚Œã?¦ã?Šã‚Šã€?ã?“ã?®ã‚ªãƒ—ã‚·ãƒ§ãƒ³ã?®ä½¿ç”¨ã?¯é?žæŽ¨å¥¨ã?§ã?™ã€‚è¿½åŠ ã?®æƒ…å ±ã?¯ http://trac.openlayers.org/wiki/SphericalMercator ã?§å…¥æ‰‹ã?§ã??ã?¾ã?™ã€‚",

    'methodDeprecated': "ã?“ã?®ãƒ¡ã‚½ãƒƒãƒ‰ã?¯å»ƒæ­¢ã?Œäºˆå®šã?•ã‚Œã?¦ã?Šã‚Šã€?ãƒ?ãƒ¼ã‚¸ãƒ§ãƒ³3.0ã?§é™¤åŽ»ã?•ã‚Œã?¾ã?™ã€‚ä»£ã‚?ã‚Šã?« ${newMethod} ã‚’ä½¿ç”¨ã?—ã?¦ã??ã? ã?•ã?„ã€‚",

    'boundsAddError': "x ã?¨ y ä¸¡æ–¹ã?®å€¤ã‚’ add é–¢æ•°ã?«æ¸¡ã?•ã?ªã?‘ã‚Œã?°ã?ªã‚Šã?¾ã?›ã‚“ã€‚",

    'lonlatAddError': "lon ã?¨ lat ä¸¡æ–¹ã?®å€¤ã‚’ add é–¢æ•°ã?«æ¸¡ã?•ã?ªã?‘ã‚Œã?°ã?ªã‚Šã?¾ã?›ã‚“ã€‚",

    'pixelAddError': "x ã?¨ y ã?®å€¤ä¸¡æ–¹ã‚’ add é–¢æ•°ã?«æ¸¡ã?•ã?ªã?‘ã‚Œã?°ã?ªã‚Šã?¾ã?›ã‚“ã€‚",

    'unsupportedGeometryType': "æœªå¯¾å¿œã?®å½¢çŠ¶åž‹: ${geomType}",

    'filterEvaluateNotImplemented': "ã?“ã?®ãƒ•ã‚£ãƒ«ã‚¿ãƒ¼åž‹ã?«ã?¤ã?„ã?¦ evaluate ã?¯å®Ÿè£…ã?•ã‚Œã?¦ã?„ã?¾ã?›ã‚“ã€‚"

});
